"""
使用 解析解法 求解MDP中的状态价值
"""


import numpy as np



#---------------------------------------------------------------------------------------
# 状态转移矩阵 & 奖励函数
#---------------------------------------------------------------------------------------
P_from_mdp_to_mrp = [
    [0.5, 0.5, 0.0, 0.0, 0.0], 
    [0.5, 0.0, 0.5, 0.0, 0.0], 
    [0.0, 0.0, 0.0, 0.5, 0.5], 
    [0.0, 0.1, 0.2, 0.2, 0.5], 
    [0.0, 0.0, 0.0, 0.0, 1.0],
]
P_from_mdp_to_mrp = np.array(P_from_mdp_to_mrp)

R_from_mdp_to_mrp = [-0.5, -1.5, -1.0, 5.5, 0]



#---------------------------------------------------------------------------------------
# 贝尔曼方程的矩阵形式计算解析解, states_num为MRP的状态数
#---------------------------------------------------------------------------------------
def compute(P, rewards, gamma, states_num):
    rewards = np.array(rewards).reshape((-1,1))     # 将rewards转换成列向量的形式
    value = np.dot(np.linalg.inv(np.eye(states_num, states_num) - gamma * P), rewards)
    return value



#---------------------------------------------------------------------------------------
# 求解价值函数(解析解法)
#---------------------------------------------------------------------------------------
gamma = 0.5
V = compute(P_from_mdp_to_mrp, R_from_mdp_to_mrp, gamma, 5)

print("MDP中每个状态价值分别为\n", V)







