import numpy as np


np.random.seed(0)



#---------------------------------------------------------------------------------------
# 马尔可夫奖励过程
#---------------------------------------------------------------------------------------
P = [
    [0.9, 0.1, 0.0, 0.0, 0.0, 0.0],
    [0.5, 0.0, 0.5, 0.0, 0.0, 0.0],
    [0.0, 0.0, 0.0, 0.6, 0.0, 0.4],
    [0.0, 0.0, 0.0, 0.0, 0.3, 0.7],
    [0.0, 0.2, 0.3, 0.5, 0.0, 0.0],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.1],
]
P = np.array(P)                     # 定义状态转移概率矩阵P
rewards = [-1, -2, -2, 10, 1, 0]     # 定义奖励函数
gamma = 0.5                         # 定义折扣因子


# 计算从某个索引(起始状态)开始到序列最后(终止状态)得到的回报
def compute_return(start_index, chain, gamma):
    G = 0
    for i in reversed(range(start_index, len(chain))):
        G = gamma * G + rewards[chain[i]-1]
    return G



#---------------------------------------------------------------------------------------
# 给定某状态序列计算回报
#---------------------------------------------------------------------------------------
start_index = 0
chain = [1, 2, 3, 6]                # 1个状态序列, s1-s2-s3-s6
G = compute_return(start_index, chain, gamma)

print("根据本序列计算得到的回报为: %s." %G)



#---------------------------------------------------------------------------------------
# 求解价值函数(解析解法)
#---------------------------------------------------------------------------------------
# 贝尔曼方程的矩阵形式计算解析解, states_num为MRP的状态数
def compute(P, rewards, gamma, states_num):
    rewards = np.array(rewards).reshape((-1,1))     # 将rewards转换成列向量的形式
    value = np.dot(np.linalg.inv(np.eye(states_num, states_num) - gamma * P), rewards)
    return value

V = compute(P, rewards, gamma, 6)

print("MRP中每个状态价值分别为\n", V)






